package com.yunqilai.delivery.ui.view;

import android.text.InputFilter;
import android.text.Spanned;

/**
 * 屏蔽emoji表情的过滤（不完全，持续改进）
 * @author kk
 *
 */
public class EmojiInputFilter implements InputFilter {
	/**
	 * emoji表情的数据字典，后期可以继续添加
	 */
	private String emojis = "😊😍😘😳😡😓😲😭😁😱😖😉😏😜😰😢😚😄😪😣" +
			"😔😠😌😝😂😥😃😨😒😷😞👿👽👀👃👄👂❤💔" +
			"💘💝💜💛💚💙💩👍👎👊✌👌💪👆👇👈👉✊👐🙏🙌" +
			"👏👧👦👩👨👶👵👴👳👲👱👸👷💂👮🙆🙅💇💆💁" +
			"👯👫🎎🚶🏃💃💑💏👼💀🐱🐶🐭🐹🐰🐺🐸🐯🐨🐻" +
			"🐷🐮🐗🐵🐴🐍🐦🐔🐧🐛🐙🐠🐳🐬☀☔🌙✨⭐⚡" +
			"☁⛄🌊❗❓💤💦🎵🔥🌹🌺🌻🌷🌸💐🍀🌾🍃🍂🍁" +
			"🎍🌴🌵🎅👻🎃🎄🔔🎉🎈💿📷🎥💻📺🔓🔒🔑💡📬" +
			"🛀💰🔫💊💣⚽🏈🏀🎾🎿🏄🏊🏆👾🎤🎸👙👑🌂👜" +
			"💄💅💍🎁💎☕🎂🍰🍺🍻🍸🍵🍶🍔🍟🍝🍜🍧🍦🍡" +
			"🍙🍘🍞🍛🍚🍲🍱🍣🍎🍓🍉🍆🍅🍊🚀🚑🚒🚓🚕🚗" +
			"🚃🚉🚄🚙🚲🏁🚹🚺⭕❌";//共230个
	
	@Override
	public CharSequence filter(CharSequence source, int start, int end,
							   Spanned dest, int dstart, int dend) {
//		return source.toString().replaceAll("[^\\u0000-\\uFFFF]", "");		//过滤的不是很完全
		if(emojis.contains(source)){
			return "";
		}
		return source;
	}

}
